dfantonio/Softstarter-using-ARM-STM32F411/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * Copyright (c) 2018 STMicroelectronics International N.V.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other
 *    contributors to this software may be used to endorse or promote products
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under
 *    this license is void and will automatically terminate your rights under
 *    this license.
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "math.h"
#include "stdio.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart2;

osThreadId RampHandle;
osThreadId VerifyHandle;
osThreadId CounterHandle;
osThreadId SerialHandle;
osThreadId OverCurrentHandle;
osThreadId ComecaHandle;
osThreadId RPMHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);

//! Counts up or down depending on the settings
void RampTask(void const * argument);

//! Monitors the current percentage and if the board button is pressed
void VerifyTask(void const * argument);

//! Verifies for the end of ramps and 150% overcurrent protection
void CounterTask(void const * argument);

//! Responsable for the serial stuff
void SerialTask(void const * argument);

//! Calculates the RMS current based on the ADC read
void OverCurrentTask(void const * argument);

//! Initialize all the peripherals and then lock the thread itself
void Comeca_Task(void const * argument);

//! Measure and calculates the RPM
void RPMTask(void const * argument);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
//! If it's on the soft is in a ramp
char fg_Start = 0;

//! Shows if the soft is idle
char fg_End = 1;

//! Indicates if the ADC conversion is over
char fg_ADC_current = 0;

//! Is the acceleration time in milliseconds
int tempo_up = 10000;

//! Deceleration time in milliseconds
int tempo_down = 7000;

//! time used as a reference for the ramps in milliseconds
float tempo;

//! Delay to the pulse on triac in microseconds
int PULSE_DELAY = 8330;

//! Width of the triac's pulse in microseconds
int PULSE_WIDTH = 1;

//! Reference pulse width for the triac in microseconds
int PULSE_WIDTH_CONST = 1000;

//! Minimal delay time to triac
int minimal_delay = 500;

//! It's part of the process to determine the PULSE_DELAY
float delay;

//! Defines if it's a acceleration or deceleration ramp
int RampUp = 1;

//! Is the RPM of the motor
int RPM;

//! The time variable responsible for the entire counting process
int counter;

//! Is the current RMS
int Irms;

//! Is the relation between the 12 bits from the ADC and the current itself. It basically converts the voltage into current
float relation = 1.4325;

//! Is the nominal current of the motor
int corrente_nominal = 400;

//! Indicates if the soft shall start through the serial
int fg_serial = 0;

//! Is a vector of reads from the ADC
uint16_t adc_current[16];

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

//! Is the callback from the DMA which stands for the end of conversion
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
	fg_ADC_current = 1;
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 *
 * @retval None
 */
int main(void) {
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

