dfantonio/Softstarter-using-ARM-STM32F411/Src/main.c
		}
		osDelay(25);
	}
	/* USER CODE END 5 */
}

/* VerifyTask function */
void VerifyTask(void const * argument) {
	/* USER CODE BEGIN VerifyTask */
	/* Infinite loop */

	for (;;) {
		if ((HAL_GPIO_ReadPin(Button_GPIO_Port, Button_Pin) == GPIO_PIN_RESET
				|| fg_serial) && fg_End == 1) {

			fg_serial = 0;
			fg_Start = 1;
			fg_End = 0;
			if (RampUp == 1) {
				tempo = tempo_up;
				counter = tempo;
			} else {
				HAL_GPIO_WritePin(bypass_relay_GPIO_Port, bypass_relay_Pin,
						GPIO_PIN_RESET);
				tempo = tempo_down;
				counter = 0;
			}
		}

		if (Irms >= 0 && Irms < corrente_nominal * 1.5) {
			HAL_GPIO_WritePin(GPIOC, Green_LED_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOC, Yellow_LED_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOC, Red_LED_Pin, GPIO_PIN_RESET);
		}

		if (Irms > corrente_nominal * 1.5 && Irms < corrente_nominal * 2) {
			HAL_GPIO_WritePin(GPIOC, Green_LED_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOC, Yellow_LED_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOC, Red_LED_Pin, GPIO_PIN_RESET);
		}

		if (Irms > corrente_nominal * 2) {
			HAL_GPIO_WritePin(GPIOC, Green_LED_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOC, Yellow_LED_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOC, Red_LED_Pin, GPIO_PIN_SET);

			HAL_GPIO_WritePin(bypass_relay_GPIO_Port, bypass_relay_Pin,
					GPIO_PIN_RESET);
			counter = 1;
			RampUp = 1;
			fg_Start = 0;
			fg_End = 1;
			PULSE_DELAY = 8330;
			PULSE_WIDTH = 1;
		}

		osDelay(20);
	}
	/* USER CODE END VerifyTask */
}

/* CounterTask function */
void CounterTask(void const * argument) {
	/* USER CODE BEGIN CounterTask */
	/* Infinite loop */
	for (;;) {

		//Verifies if acceleration ramp is over
		if (RampUp == 1 && counter <= 0) {
			HAL_GPIO_WritePin(bypass_relay_GPIO_Port, bypass_relay_Pin,
					GPIO_PIN_SET);
			fg_Start = 0;
			fg_End = 1;
			RampUp = !RampUp;
		}

		//Verifies if deceleration ramp is over
		if (RampUp == 0 && counter >= tempo) {
			fg_Start = 0;
			fg_End = 1;
			RampUp = !RampUp;
		}
		if (fg_Start) {
			if (RampUp == 1) {
				counter = counter - 2;
				if (HAL_GPIO_ReadPin(GPIOC, Yellow_LED_Pin) == GPIO_PIN_SET)
					counter = counter + 2;
			}
			if (RampUp == 0)
				counter = counter + 2;

			delay = (counter / tempo * (8333 - minimal_delay));
			PULSE_DELAY = delay + minimal_delay;

		}

		if ((PULSE_DELAY >= (8333 - PULSE_WIDTH) && RampUp == 0))
			PULSE_WIDTH = (8333 - PULSE_DELAY);
		if ((PULSE_WIDTH < PULSE_WIDTH_CONST && RampUp == 1))
			PULSE_WIDTH = (8333 - PULSE_DELAY);

		osDelay(2);
	}
	/* USER CODE END CounterTask */
}

/* SerialTask function */
void SerialTask(void const * argument) {
	/* USER CODE BEGIN SerialTask */
	/* Infinite loop */
	char rx, tempo_serial[6];
	char texto[100];
	int fg_status = 0;
	int size, aux;
	int numero;

	for (;;) {

		//Sends an overview of the current status
		if (fg_status) {
			//size =sprintf(texto,"Counter = %d	Tempo de delay = %d	Fg_start = %d	RPM = %d	\n",counter, PULSE_DELAY, fg_Start, RPM);
			size = sprintf(texto, "Irms = %d\n", Irms);
			HAL_UART_Transmit(&huart2, texto, size, 100);
			osDelay(100);
		}

		if (HAL_UART_Receive(&huart2, tempo_serial, 3, 1) == HAL_OK) {

			if (tempo_serial[0] == 'u') {
				tempo_serial[0] = tempo_serial[1];
				tempo_serial[1] = tempo_serial[2];
				tempo_serial[2] = 0;
				tempo_serial[3] = 0;

				tempo_up = atoi(tempo_serial);
				tempo_up *= 1000;
				fg_serial = 1;
			}

			if (tempo_serial[0] == 'd') {
				tempo_serial[0] = tempo_serial[1];
				tempo_serial[1] = tempo_serial[2];
				tempo_serial[2] = 0;
				tempo_serial[3] = 0;

				tempo_down = atoi(tempo_serial);
				tempo_down *= 1000;
				fg_serial = 1;
			}

			if (tempo_serial[0] == '$') {
				size = sprintf(texto, "I%i;R%i\n", Irms, RPM);
				HAL_UART_Transmit(&huart2, texto, size, 100);
			}

		}

		//Receives a single char from serial
		//HAL_UART_Receive(&huart2, &rx, 1, 1);
		//osDelay(1);

		//u stands for changing the acceleration time
		if (rx == 'u') {
			if (HAL_UART_Receive(&huart2, tempo_serial, 2, 5000) == HAL_OK) {
				tempo_up = atoi(tempo_serial);
				tempo_up *= 1000;

				fg_serial = 1;
//				if (RampUp == 1 && fg_End == 1) {
//					tempo = tempo_up;
//					counter = tempo;
//					fg_Start = 1;
//					fg_End = 0;
//				}

			} else {
				size = sprintf(texto, "TIMEOUT - Acceleration Time\n");
				HAL_UART_Transmit(&huart2, texto, size, 100);
			}
		}

		//d stand for changing the deceleration time
		if (rx == 'd') {
			if (HAL_UART_Receive(&huart2, tempo_serial, 2, 5000) == HAL_OK) {
				tempo_down = atoi(tempo_serial);
				tempo_down *= 1000;

				fg_serial = 1;

//				fg_Start = 1;
//				fg_End = 0;
//				HAL_GPIO_WritePin(bypass_relay_GPIO_Port, bypass_relay_Pin,
//						GPIO_PIN_RESET);

				//counter = 0;

			} else {
				size = sprintf(texto, "TIMEOUT - Deceleration Time\n");
				HAL_UART_Transmit(&huart2, texto, size, 100);
			}
		}

		//t stand for toggling the status through the serial
		if (rx == 't') {
			if (fg_status == 0)
				fg_status = 1;
			else
				fg_status = 0;
		}

		//c stand for defining the new relation of current
		if (rx == 'c') {
			if (HAL_UART_Receive(&huart2, tempo_serial, 3, 3000) == HAL_OK) {
				relation = 1;
				osDelay(250);
				relation = Irms;
				relation /= atoi(tempo_serial);

				corrente_nominal = atoi(tempo_serial);

				//relation = Irms/atoi(tempo_serial);
			}
		}

		//h stand for printing a serial command list
		if (rx == 'h') {
			size =
					sprintf(texto,
							"LIST OF SERIAL COMMANDS:\nu - Changes the acceleration time\nd - changes the deceleration time\nt - toggles the status through the serial\nh - prints the help menu\n");
			HAL_UART_Transmit(&huart2, texto, size, 100);
		}

		if (rx == '#') {
			size = sprintf(texto, "u %i d %i\n", tempo_up, tempo_down);
			HAL_UART_Transmit(&huart2, texto, size, 100);
		}

		rx = 0;
		osDelay(1);
	}
	/* USER CODE END SerialTask */
}

/* OverCurrentTask function */
void OverCurrentTask(void const * argument) {
	/* USER CODE BEGIN OverCurrentTask */
	/* Infinite loop */
	float ADC_value[16];
	int index = 0;
	int aux;
	int result;
	int rms;
	int Medidas_ADC = 16;
	int sum[32];

