dfantonio/Softstarter-using-ARM-STM32F411/Src/main.c
	for (;;) {
		if (fg_ADC_current) {
			fg_ADC_current = 0;

			for (aux = 0; aux < Medidas_ADC; aux++) { //Faz com que o valor seja de 311 de pico com 2v na entrada
				//ADC_value[aux] = (adc_current[aux] / relation); //Rela��o entre 311 e o valor do AD pra 2v
				ADC_value[aux] = (adc_current[aux]); //Rela��o entre 311 e o valor do AD pra 2v
			}

			rms = 0;
			for (aux = 0; aux < Medidas_ADC; aux++) {
				rms += pow(ADC_value[aux], 2);
			}

			rms = sqrt((rms / Medidas_ADC));

			rms /= relation;

			if (index > 31) {
				index = 0;
				Irms = 0;
				for (aux = 0; aux < 32; aux++) {
					Irms += sum[aux];
				}
				Irms /= 32;
				Irms -= 5;
				if (Irms < 0)
					Irms = 0;
			}

			sum[index] = rms;
			index++;
			//quando der overcurrent mandar um "i" via serial (S� O CARACTER)
			//quando der overvoltage mandar um "v" via serial (S� O CARACTER)

		}

		osDelay(10);
	}
	/* USER CODE END OverCurrentTask */
}

/* Comeca_Task function */
void Comeca_Task(void const * argument) {
	/* USER CODE BEGIN Comeca_Task */
	/* Infinite loop */
	char texto[50];
	int size;

	tempo = tempo_up;
	counter = tempo;

	HAL_ADC_Start_DMA(&hadc1, (uint32_t *) adc_current, 16); //N�O CONSIGO FAZER ESSA PORRA FUNCIONAR!!!!!
	HAL_TIM_Base_Start(&htim3);
	HAL_TIM_Base_Start(&htim1);

	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);

	__HAL_TIM_SET_AUTORELOAD(&htim2, PULSE_DELAY + PULSE_WIDTH - 1);
	__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, PULSE_DELAY);

	size = sprintf(texto, "Iniciando perifericos");
	HAL_UART_Transmit(&huart2, texto, size, 100);

	vTaskSuspend(ComecaHandle);

	size = sprintf(texto, "fechando perifericos");
	HAL_UART_Transmit(&huart2, texto, size, 100);

	for (;;) {
		osDelay(1);
	}
	/* USER CODE END Comeca_Task */
}

/* RPMTask function */
void RPMTask(void const * argument) {
	/* USER CODE BEGIN RPMTask */
	/* Infinite loop */
	int size;
	char texto[100];
	for (;;) {
		RPM = __HAL_TIM_GET_COUNTER(&htim1);
		RPM *= 60;

		size = sprintf(texto, "RPM: %d\n", RPM);
		//HAL_UART_Transmit(&huart2, texto, size, 100);

		__HAL_TIM_SET_COUNTER(&htim1, 0);

		osDelay(1000);
	}
	/* USER CODE END RPMTask */
}

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM11 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	/* USER CODE BEGIN Callback 0 */

	/* USER CODE END Callback 0 */
	if (htim->Instance == TIM11) {
		HAL_IncTick();
	}
	/* USER CODE BEGIN Callback 1 */

	/* USER CODE END Callback 1 */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  file: The file name as string.
 * @param  line: The line in file as a number.
 * @retval None
 */
void _Error_Handler(char *file, int line) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
	 tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
